In [9]:
import pandas as pd ## pandas 라이브러리를 불러옵니다.

## 1.pandas data structure (1)

python list to pandas series

In [10]:
L = [1,2,3,4,5]
pd.Series(L)

0    1
1    2
2    3
3    4
4    5
dtype: int64

## 2.pandas data structure (2)

pandas dataframe creation

문제 : 열의 이름은 A,B,C,D 이고 열마다 5개의  random한 숫자를 원소로 하는 DataFrame을 생성하는 코드를 작성

In [25]:
import numpy as np

df = pd.DataFrame(np.random.randn(5,4), columns=list('ABCD'))
df

          A         B         C         D
0 -1.142747 -0.606893  1.125299 -0.546331
1 -1.729292 -0.267414 -0.020324 -1.666729
2  0.238898  0.553962 -1.024910 -1.982113
3 -0.232411  0.221254  1.821071 -1.469115
4  2.282980  0.876405  1.300092  0.056624

In [20]:
study_card = {'ID' : [20190103, 20190222, 20190531],
              'name' : ['Kim', 'Lee', 'Jeong'],
              'class' : ['H','W','S']}
pd.DataFrame(study_card)

         ID   name class
0  20190103    Kim     H
1  20190222    Lee     W
2  20190531  Jeong     S

## 3.pandas data structure (3)

문제 : 2번 문제에서 생성한 DataFrame의 index로 2020년 1월 1일 부터 2020년 1월 5일까지의 날짜를 지정하는 코드를 작성해보세요.

In [71]:
dates = pd.date_range('20200101', periods=12) # date_range() 함수 사용
df = df.set_index(dates)
df

                   A         B         C         D
2020-01-01  1.021466 -0.559118 -1.130987 -1.217564
2020-01-02  0.771956  0.628227 -1.273924  1.168309
2020-01-03 -0.431620 -0.006670  0.568162 -0.282012
2020-01-04  1.396732  2.151897 -0.502668  0.550309
2020-01-05 -1.585877  1.085737  0.031907 -0.108157
2020-01-06  0.373304 -1.886434  1.265019  0.844318
2020-01-07  0.503786 -1.052333 -0.059051  0.792839
2020-01-08  0.058740  0.294565 -0.491830  0.980444
2020-01-09  0.415370  0.280252 -0.104958 -1.155432
2020-01-10  1.121339  0.854884 -0.925155  2.152860
2020-01-11  0.449233  0.522149  0.064433  0.175056
2020-01-12  1.013759 -0.769213 -1.183089  0.985532

## 4.DataFrame method (1)

In [44]:
cols = ['A', 'B', 'C', 'D']

data = [[c+str(i) for i in range(12)] for c in cols]

df_b = pd.DataFrame(np.array(data).T, index=range(0, 12), columns=cols)

df_b

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## 5.DataFrame method (2)

문제 : df_b를 이용해서, 위에서부터 5개의 행을 출력하는 코드를 작성해보세요.

In [45]:
df_b.head() ## .head() : 5개의 행을 출력

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4

In [46]:
df_b[:5]

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4

In [47]:
df_b.head(5)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4

## 6.DataFrame method (3)

df_B를 이용해서 DataFrame의 index와 columns, values를 각각 추출해내는 코드를 작성해보세요.

In [60]:
## pandas dataframe print columns
for col in df_b.columns:
    print(col)

list(df_b.columns)

A
B
C
D

['A', 'B', 'C', 'D']

In [61]:
## pandas dataframe print values

list(df_b.values)

[array(['A0', 'B0', 'C0', 'D0'], dtype=object),
 array(['A1', 'B1', 'C1', 'D1'], dtype=object),
 array(['A2', 'B2', 'C2', 'D2'], dtype=object),
 array(['A3', 'B3', 'C3', 'D3'], dtype=object),
 array(['A4', 'B4', 'C4', 'D4'], dtype=object),
 array(['A5', 'B5', 'C5', 'D5'], dtype=object),
 array(['A6', 'B6', 'C6', 'D6'], dtype=object),
 array(['A7', 'B7', 'C7', 'D7'], dtype=object),
 array(['A8', 'B8', 'C8', 'D8'], dtype=object),
 array(['A9', 'B9', 'C9', 'D9'], dtype=object),
 array(['A10', 'B10', 'C10', 'D10'], dtype=object),
 array(['A11', 'B11', 'C11', 'D11'], dtype=object)]

In [62]:
## pandas dataframe index

list(df_b.index)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]

## 7.DataFrame method (4)

df_b를 이용해서, DataFrame의 요약정보를 출력하는 코드를 작성해보세요.

In [63]:
df_b

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [65]:
df_b.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       12 non-null     object
 1   B       12 non-null     object
 2   C       12 non-null     object
 3   D       12 non-null     object
dtypes: object(4)
memory usage: 512.0+ bytes

## 8.DataFrame method (5)

df_A를 이용해서 해당 DataFrame의 전체적인 통계량(통계정보)을 보여주는 코드를 작성해보세요.

In [73]:
dates = pd.date_range('20200101', periods=12) # date_range() 함수 사용
df_A = df.set_index(dates).head()
df_A

                   A         B         C         D
2020-01-01  1.021466 -0.559118 -1.130987 -1.217564
2020-01-02  0.771956  0.628227 -1.273924  1.168309
2020-01-03 -0.431620 -0.006670  0.568162 -0.282012
2020-01-04  1.396732  2.151897 -0.502668  0.550309
2020-01-05 -1.585877  1.085737  0.031907 -0.108157

In [74]:
df_A.describe()

              A         B         C         D
count  5.000000  5.000000  5.000000  5.000000
mean   0.234531  0.660015 -0.461502  0.022177
std    1.226422  1.041479  0.776787  0.899864
min   -1.585877 -0.559118 -1.273924 -1.217564
25%   -0.431620 -0.006670 -1.130987 -0.282012
50%    0.771956  0.628227 -0.502668 -0.108157
75%    1.021466  1.085737  0.031907  0.550309
max    1.396732  2.151897  0.568162  1.168309

## 9.sorting

df_A를 이용해서, column C 기준으로 내림차순 정렬한 결과를 출력하는 코드를 작성해보세요.

In [75]:
df_A

                   A         B         C         D
2020-01-01  1.021466 -0.559118 -1.130987 -1.217564
2020-01-02  0.771956  0.628227 -1.273924  1.168309
2020-01-03 -0.431620 -0.006670  0.568162 -0.282012
2020-01-04  1.396732  2.151897 -0.502668  0.550309
2020-01-05 -1.585877  1.085737  0.031907 -0.108157

In [79]:
df_A.sort_values(by=['C'],ascending = [False])

                   A         B         C         D
2020-01-03 -0.431620 -0.006670  0.568162 -0.282012
2020-01-05 -1.585877  1.085737  0.031907 -0.108157
2020-01-04  1.396732  2.151897 -0.502668  0.550309
2020-01-01  1.021466 -0.559118 -1.130987 -1.217564
2020-01-02  0.771956  0.628227 -1.273924  1.168309

## 10.indexing (1)

df_A를 이용해서, column A(A열)를 출력하는 코드를 작성해보세요.

In [87]:
df_A['A']

2020-01-01    1.021466
2020-01-02    0.771956
2020-01-03   -0.431620
2020-01-04    1.396732
2020-01-05   -1.585877
Freq: D, Name: A, dtype: float64

## 11.indexing (2)

df_A를 이용해서,

1. 3번째 행의 원소들,

2. index가 2020-01-05에 해당하는 행

을 출력하는 코드를 작성해보세요.

In [95]:
df_A

                   A         B         C         D
2020-01-01  1.021466 -0.559118 -1.130987 -1.217564
2020-01-02  0.771956  0.628227 -1.273924  1.168309
2020-01-03 -0.431620 -0.006670  0.568162 -0.282012
2020-01-04  1.396732  2.151897 -0.502668  0.550309
2020-01-05 -1.585877  1.085737  0.031907 -0.108157

In [99]:
df_A.iloc[2,:]

A   -0.431620
B   -0.006670
C    0.568162
D   -0.282012
Name: 2020-01-03 00:00:00, dtype: float64

In [100]:
df_A.loc['2020-01-03',:]

A   -0.431620
B   -0.006670
C    0.568162
D   -0.282012
Name: 2020-01-03 00:00:00, dtype: float64

In [112]:
df_A.loc['2020-01-05',:]

A   -1.585877
B    1.085737
C    0.031907
D   -0.108157
Name: 2020-01-05 00:00:00, dtype: float64

## 12.indexing (3)

df_A를 이용해서, 2020년 1월 2일부터 2020년 1월 4일까지의 데이터중에 column A, B에 해당하는 데이터를 출력하는 코드를 작성해보세요.

In [113]:
df_A[["A","B"]][1:4] ## 2개 이상의 열을 인덱싱할 때는 "대괄호"임을 명시하자

                   A         B
2020-01-02  0.771956  0.628227
2020-01-03 -0.431620 -0.006670
2020-01-04  1.396732  2.151897

## 13.indexing (4)

df_A에서 0보다 큰 데이터를 모두 출력하는 코드를 작성하세요.

(해당 데이터가 조건에 해당되지 않아 빈 칸일때 NaN으로 출력됩니다. NaN은 Not a Number 라는 의미입니다.)

In [119]:
df_A[df_A > 0]

                   A         B         C         D
2020-01-01  1.021466       NaN       NaN       NaN
2020-01-02  0.771956  0.628227       NaN  1.168309
2020-01-03       NaN       NaN  0.568162       NaN
2020-01-04  1.396732  2.151897       NaN  0.550309
2020-01-05       NaN  1.085737  0.031907       NaN

## 14.concat (1)

위-아래로 합쳐진 DataFrame을 생성하는 코드를 작성해보세요.

In [124]:
df_1 = {'A':[1,2],
        'B':[3,4],
        'C':[5,6]}
df_a = pd.DataFrame(df_1)
df_a

   A  B  C
0  1  3  5
1  2  4  6

In [125]:
df_2 = {'A':[-1,-2],
        'B':[-3,-4],
        'C':[-5,-6]}
df_b = pd.DataFrame(df_2)
df_b

   A  B  C
0 -1 -3 -5
1 -2 -4 -6

In [127]:
result = pd.concat([df_a,df_b])
result

   A  B  C
0  1  3  5
1  2  4  6
0 -1 -3 -5
1 -2 -4 -6

## 15.concat (2)

양옆으로 합쳐진 DataFrame을 생성하는 코드를 작성해보세요.

In [129]:
pd.concat([df_a,df_b],axis=1)

   A  B  C  A  B  C
0  1  3  5 -1 -3 -5
1  2  4  6 -2 -4 -6